IDEA StatiCa Open Model
ConcreteBlockData Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Provides data of the single concrete block
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConcreteBlockData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConcreteBlockData
Public Class ConcreteBlockData
public ref class ConcreteBlockData
The ConcreteBlockData type exposes the following members.
Constructors
Name | Description
ConcreteBlockData
Initializes a new instance of the ConcreteBlockData class
Top
Properties
Name | Description
AxisX
 LCS - Axis X
AxisY
 LCS - Axis Y
AxisZ
 LCS - Axis Z
Center
 Center of the concrete block LCS
Depth
 Depth of the concrete block
Id
 Plate unique ID
Material
 Name of the material
Name
 Name of the concrete block
Origin
 Origin of the concrete block LCS
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
OutlinePoints
 Outline points
Region
 Geometry of the concrete block in svg format
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace